app/controllers/guesses_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "solution" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["solution", "t"], ["updated_at", "2015-06-22 02:14:20.024049"], ["id", 3]]
INSERT INTO "guesses" ("guess", "points", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["guess", "test"], ["points", 0], ["user_id", 5], ["post_id", 1], ["created_at", "2015-06-22 00:53:54.273151"], ["updated_at", "2015-06-22 00:53:54.273151"]]
---
  def create
    @post = Post.find(params[:id])
    score = params[:guess].downcase == @post.answer ? 1 : 0
    @guess = @post.guesses.new(guess: params[:guess].downcase,
                               points: score,
                               user_id: current_user.id)

    if @guess.guess == @post.answer
       @post.update(solution: true)
    end

    if @guess.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT SUM("guesses"."points") FROM "guesses" WHERE "guesses"."user_id" = $1  [["user_id", 1]]
UPDATE "users" SET "total_points" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["total_points", 0], ["updated_at", "2015-06-22 01:03:14.571838"], ["id", 1]]
---
  def score
    @user = User.find(params[:id])
    @total_score = @user.guesses.sum(:points)
    @user.update(total_points: @total_score)