app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    render json: Post.all, status: :ok

INSERT INTO "posts" ("answer", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["answer", "markdown"], ["user_id", 2], ["created_at", "2015-06-19 15:28:27.682274"], ["updated_at", "2015-06-19 15:28:27.682274"]]
---
  def create
    @post = current_user.posts.new(image_url: params[:image_url],
                                   answer: params[:answer].downcase,
                                   user_id: params[:user_id])
    if @post.save