app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "full_name", "username", "access_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    passhash = Digest::SHA1.hexdigest(params[:password])
    @user = User.new(email: params[:email],
                     password: passhash,
                     full_name: params[:full_name],
                     username: params[:username])
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."password" = $1 AND "users"."username" = $2 LIMIT 1  [["password", "56959f3f9f015798b020cf1a99043cc6b9cdd227"], ["username", "tterris"]]
---
  def login
    passhash = Digest::SHA1.hexdigest(params[:password])
    @user = User.find_by(password: passhash,
                         username: params[:username])

SELECT  "users".* FROM "users"  ORDER BY "users"."total_points" DESC LIMIT 5
---
  def scoreboard
    @users = User.order(total_points: :desc).limit(5)